---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetService(System.Int32)
source: html/428c7eb4-2dec-4038-3dd4-4dd2a1fd85bd.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetService Method

Get the service based on the service identifier from the fabrication configuration in the current document.

## Syntax (C#)
```csharp
public FabricationService GetService(
	int serviceId
)
```

## Parameters
- **serviceId** (`System.Int32`) - The service identifier.

## Returns
The service based on the service identifier.